# ExportPatternTable Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportPatternTable Properties
ExportPatternTable Class See Also
---
The ExportPatternTable type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | Count of the items contained in the collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Item | A copy of the ExportPatternInfo for the pattern's ExportPatternKey. |

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace